Terraform Plan:
```data.aws_route53_zone._127cyber-name: Reading...
aws_eip.nat_eip: Refreshing state... [id=eipalloc-04195779597826077]
aws_vpc.main: Refreshing state... [id=vpc-06ef649a6525a65b9]
aws_acm_certificate._127cyber_wildcard_cert: Refreshing state... [id=arn:aws:acm:ap-southeast-2:941133421128:certificate/70446068-84a3-4580-b9be-43bb473653cd]
aws_iam_role.ec2_instance_role: Refreshing state... [id=ec2-instance-role-generic]
data.aws_caller_identity.current: Reading...
aws_iam_policy.certbot_dns_route53: Refreshing state... [id=arn:aws:iam::941133421128:policy/CertbotDNSRoute53]
data.aws_caller_identity.current: Read complete after 0s [id=941133421128]
aws_kms_key.siem_key: Refreshing state... [id=0ecbd38c-6753-4ea4-bb08-d9b62ca94086]
aws_iam_role_policy_attachment.certbot_dns_route53_attachment: Refreshing state... [id=ec2-instance-role-generic-20240401014021393200000002]
aws_iam_role_policy_attachment.ssm_managed_instance_core: Refreshing state... [id=ec2-instance-role-generic-20240401014021663400000003]
aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=ec2-instance-profile]
aws_iam_role_policy_attachment.cloudwatch_agent_server_policy: Refreshing state... [id=ec2-instance-role-generic-20240401014022335500000004]
data.aws_route53_zone._127cyber-name: Read complete after 0s [id=Z03093112GERZ97ION6VA]
aws_route53_record._127cyber_wildcard_cert_validation["*.127cyber.com"]: Refreshing state... [id=Z03093112GERZ97ION6VA__138665dd27ee909427cb33f3f8ce3b81.127cyber.com._CNAME]
aws_acm_certificate_validation._127cyber_wildcard_cert_validation: Refreshing state... [id=2024-04-01 01:40:51.852 +0000 UTC]
aws_kms_alias.siem_key_alias: Refreshing state... [id=alias/siem_key]
aws_internet_gateway.gw: Refreshing state... [id=igw-03aec166a30d6c874]
aws_subnet.public2: Refreshing state... [id=subnet-029b55baa9885ed9e]
aws_subnet.private1: Refreshing state... [id=subnet-01c5938938de2dfb8]
aws_lb_target_group.grafana_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/grafana-tg/526cc5ad2ee9498f]
aws_lb_target_group.wazuh_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/wazuh-tg/b561b3daa989622c]
aws_lb_target_group.tg_9200: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-9200/9c008c93f534eeb3]
aws_lb_target_group.tg_1515: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-1515/63053ca52afb8235]
aws_lb_target_group.tg_1514: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-1514/6f81a88b116abab7]
aws_subnet.public1: Refreshing state... [id=subnet-08922b97fe6e06001]
aws_subnet.private2: Refreshing state... [id=subnet-0ed6ada1edfec2588]
aws_lb_target_group.tg_22: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-22/87a6de2a0a7134ae]
aws_lb_target_group.tg_55000: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-55000/23b4bb6d56fa4e55]
aws_security_group.all: Refreshing state... [id=sg-013a4042151d0f939]
aws_route_table.public: Refreshing state... [id=rtb-0c4fa764ad8440369]
aws_lb.nlb_wazuh: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:loadbalancer/net/wazuh-nlb/c9f9e6604eb1f58f]
aws_nat_gateway.nat: Refreshing state... [id=nat-0f9e36891d8bfdf66]
aws_lb.soc_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:loadbalancer/app/soc-alb/6a4793e575ede6f3]
aws_route_table_association.public2: Refreshing state... [id=rtbassoc-0d5c19e51c2483675]
aws_route_table_association.public1: Refreshing state... [id=rtbassoc-0ac2e21973b6c3eed]
module.ec2_wazuh.aws_instance.this[0]: Refreshing state... [id=i-037b2056e26d8158e]
aws_route_table.private: Refreshing state... [id=rtb-095db7dc1fbfda119]
aws_route_table_association.private2: Refreshing state... [id=rtbassoc-015488651220a4520]
aws_route_table_association.private1: Refreshing state... [id=rtbassoc-0c43bcae30183aa85]
aws_route53_record.nlb_dns: Refreshing state... [id=Z03093112GERZ97ION6VA_listen.127cyber.com_CNAME]
aws_lb_listener.listener_1515: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener/net/wazuh-nlb/c9f9e6604eb1f58f/02c64e86f54466d3]
aws_lb_listener.listener_1514: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener/net/wazuh-nlb/c9f9e6604eb1f58f/8f5f03d79825123b]
aws_lb_listener.listener_22: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener/net/wazuh-nlb/c9f9e6604eb1f58f/8871911291b60443]
aws_lb_listener.listener_55000: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener/net/wazuh-nlb/c9f9e6604eb1f58f/9c1868078688e0e7]
aws_lb_listener.listener_9200: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener/net/wazuh-nlb/c9f9e6604eb1f58f/4062aaceddbc54f6]
aws_route53_record.wazuh_record: Refreshing state... [id=Z03093112GERZ97ION6VA_wazuh.127cyber.com_A]
aws_route53_record.grafana_record: Refreshing state... [id=Z03093112GERZ97ION6VA_dashboards.127cyber.com_A]
aws_lb_listener.https_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener/app/soc-alb/6a4793e575ede6f3/c791090b2c636675]
aws_lb_listener_rule.grafana_subdomain: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener-rule/app/soc-alb/6a4793e575ede6f3/c791090b2c636675/227fc79a3d79de30]
aws_lb_listener_rule.wazuh_subdomain: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener-rule/app/soc-alb/6a4793e575ede6f3/c791090b2c636675/8805cb636d773443]
aws_lb_target_group_attachment.grafana_attachment: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/grafana-tg/526cc5ad2ee9498f-20240407105817989600000001]
aws_lb_target_group_attachment.attach_wazuh_1515: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-1515/63053ca52afb8235-20240406052832367600000006]
aws_lb_target_group_attachment.wazuh_attachment: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/wazuh-tg/b561b3daa989622c-20240406052831908200000002]
aws_lb_target_group_attachment.attach_wazuh_9200: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-9200/9c008c93f534eeb3-20240406052831984700000003]
aws_lb_target_group_attachment.attach_wazuh_22: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-22/87a6de2a0a7134ae-20240406052832361400000005]
aws_lb_target_group_attachment.attach_wazuh_55000: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-55000/23b4bb6d56fa4e55-20240406052833946400000007]
aws_lb_target_group_attachment.attach_wazuh_1514: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-1514/6f81a88b116abab7-20240406052832070900000004]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lb.soc_alb will be updated in-place
  ~ resource "aws_lb" "soc_alb" {
        id                                                           = "arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:loadbalancer/app/soc-alb/6a4793e575ede6f3"
        name                                                         = "soc-alb"
      ~ security_groups                                              = [
          - "sg-013a4042151d0f939",
        ] -> (known after apply)
        tags                                                         = {}
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_security_group.wazuh-nlb will be created
  + resource "aws_security_group" "wazuh-nlb" {
      + arn                    = (known after apply)
      + description            = "Security group for Wazuh NLB"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 1514
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 1514
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 1515
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 1515
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 1516
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 1516
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 514
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 514
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 514
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 514
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 55000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 55000
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 9200
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9200
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 9300
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9400
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "220.233.86.20/32",
                  + "39.58.182.16/32",
                ]
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "Wazuh-NLB"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Wazuh-NLB"
        }
      + tags_all               = {
          + "Name" = "Wazuh-NLB"
        }
      + vpc_id                 = "vpc-06ef649a6525a65b9"
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```